package com.surakshasathi;

import static android.text.Html.fromHtml;

import android.os.Bundle;

import androidx.core.text.HtmlCompat;
import androidx.fragment.app.Fragment;

import android.view.LayoutInflater;
import android.view.View;
import android.view.ViewGroup;
import android.widget.TextView;

public class ParentalInvolvement extends Fragment {
    public ParentalInvolvement() {

    }

    @Override
    public void onCreate(Bundle savedInstanceState) {
        super.onCreate( savedInstanceState );

    }

    TextView content,content2;

    @Override
    public View onCreateView(LayoutInflater inflater, ViewGroup container,
                             Bundle savedInstanceState) {
        // Inflate the layout for this fragment
        View view = inflater.inflate( R.layout.fragment_parental_involvement, container, false );
        content = view.findViewById( R.id.parentcontent );
        content2 = view.findViewById( R.id.parentcontent2 );

        String cont = "<b>कहानी: \"सुरक्षा की राह में\"\n<br><br></b>" +
                "एक छोटे से गाँव में एक प्यारा सा घर था, जहाँ रिया और रोहन, एक बड़े प्यारे परिवार के हिस्से थे। यह घर सिर्फ इन बच्चों के लिए ही नहीं, बल्कि माता-पिता, आलोक और नैना के लिए भी एक सुरक्षित गहरा स्थान था।\n" +
                "एक दिन, स्कूल से लौटते वक्त, रिया ने अपने माता-पिता को बताया कि उसके एक साथी ने उसे परेशान कर रखा था। आलोक और नैना ने तुरंत अपने बच्चों के साथ बैठक करी और उन्हें बचाव और समर्थन के लिए प्रेरित किया।\n" +
                "आलोक ने अपने साथी माता-पिता को बुलाया और एक साझा समझदारी की मित्रता बनाई। इससे गाँव में सुरक्षा से जुड़े अवसरों की एक शृंगार गथा बनी।\n" +
                "आलोक और नैना ने एक स्थानीय समुदाय कार्यक्रम का आयोजन किया, जिसमें स्कूल बच्चों, उनके माता-पिता, और स्थानीय निवासियों को साथ आने का आमंत्रण दिया गया। यहां, एक समृद्धि सत्र के दौरान, वे सुरक्षा के महत्व को साझा करने के लिए बातचीत करते रहे और साथ ही आलोक ने एक 'सुरक्षा मित्र' अभियान शुरू किया।इस अभियान के तहत, माता-पिता स्थानीय स्कूलों में सुरक्षा कार्यक्रमों में भाग लेने के लिए प्रेरित किए गए, ताकि वे अपने बच्चों की सुरक्षा के लिए अधिक सक्रिय रूप से योजना बना सकें।\n" +
                "इस कहानी से हमें यह सिखने को मिलता है कि माता-पिता का सहयोग और सकारात्मक प्रेरणा, समुदाय में सुरक्षा संचार को बढ़ावा देने में कैसे मदद कर सकते हैं।\n<br><br>" +
                "\n" +
                "<b>कहानी: \"माँ की संकल्पशीलता\"\n<br><br></b>"
                +
                "\n" +
                "मिसेज शर्मा, एक साधारिता से भरी माँ, जिनका एक ही मक़सद था - अपनी बेटी, ruchi, को सुरक्षित रखना।\n" +
                "Ruchi, एक नई कॉलेज में एडमिशन लेकर आई थी, लेकिन कुछ रैगिंग घटनाएं उसकी खुशी को छीन ली थीं। ये घटनाएं उसे परेशान कर रही थीं, और मिसेज शर्मा ने तय किया कि अब बहुत हो गया है।\n" +
                "उन्होंने अपने मोहल्ले में एक छोटी सी मीटिंग आयोजित की, जिसमें वह स्थानीय माता-पिता को बुला कर जेंडर-बेस्ड हिंसा के खिलाफ कैसे एकजुट हो सकते हैं, इस पर बातचीत की।\n" +
                "मिसेज शर्मा ने एक भावनात्मक दृष्टिकोण से कहानी सुनाई, जिसमें Ruchi का रैगिंग घटना हुआ, लेकिन उसने हिम्मत से खड़ा होकर उसे रोका। मिसेज शर्मा ने अपने मोहल्ले को समझाया कि एक एकजुट स्टैंड लेना ज़रूरी है।उसके बाद, उन्होंने अपने मोहल्ले में \"सुरक्षा की पुकार\" अभियान शुरू किया, जिसमें हर माता-पिता ने एक दूसरे को सुरक्षा के लिए जिम्मेदार होने का वादा किया।\n" +
                "\n" +
                "नतीजा? मिसेज शर्मा की संकल्पशीलता ने एक परिवर्तन लाया। उनका छोटा सा पहलू ने सिर्फ Ruchi को ही नहीं, बल्कि पूरे मोहल्ले को एक सुरक्षित और जागरूक बना दिया।\n<br><br>" +
                "\n" +

                "<b>कहानी: \"समानता की सुरक्षा\"\n<br><br></b>"+

                "\n" +
                "एक छोटे से गाँव में राज, एक युवा लड़का, ने तय किया कि उसे अपने गाँव में एक बदलाव लाना है। उसने महसूस किया कि लड़कियाँ बचाने और सुरक्षित रखने के लिए कुछ करना जरुरी है, और उसकी आंखों में एक नई रोशनी चमक उठी।\n" +
                "उसने गाँव के सभी लोगों को एकत्र किया और एक छोटे से सभा घेरी। वह बताया कि समानता और सुरक्षा कैसे जुड़े हुए हैं और हम सभी मिलकर अपने गाँव को सुरक्षित और अधिक समान बना सकते हैं।\n" +
                "उसके बाद, उसने एक नया पहलू शुरू किया - \"माता-पिता साथी अभियान\"। उसने सभी माता-पिता को मिलाकर बताया कि वे अपने बच्चों के साथ एक सजग समाज बना सकते हैं।\n" +
                "गाँववालों ने उसकी सोच को स्वीकारा, और माता-पिता साथी अभियान ने गाँव में एक नई उर्जा भर दी। माता-पिता ने अपने बच्चों के साथ सकारात्मक रूप से जुड़कर समाज में सुरक्षिती बढ़ाने में मदद की, और इसका असर हुआ - गाँव में नहीं सिर्फ सुरक्षिती बढ़ी, बल्कि माता-पिता और बच्चों के बीच में एक मजबूत जड़ भी बनी।";



        content.setText(fromHtml(cont, HtmlCompat.FROM_HTML_MODE_LEGACY));

        String cont2 =
                "<br><b>1.सुनिए और समझिए:</b> अपने बच्चों की बातें ध्यान से सुनें और उनकी बातों को समझें।\n<br>" +
                        "\n" +
                        "<br><b>2.सकारात्मक प्रेरणा:</b> बच्चों को सकारात्मक बनाएं और उन्हें सहारा दें।\n<br>" +
                        "\n" +
                        "<br><b>3.खुले मन से बातचीत:</b> बच्चों के साथ खुले मन से बातचीत करें।\n<br>" +
                        "\n" +
                        "<br><b>4.सुरक्षित माहौल:</b> घर में सुरक्षित माहौल बनाएं ताकि बच्चे सुरक्षित महसूस करें।\n<br>" +
                        "\n" +
                        "<br><b>5.शिक्षा में सहयोग:</b> बच्चों को जेंडर-बेस्ड हिंसा के खिलाफ शिक्षा में सहयोग करें।\n<br>" +
                        "\n" +
                        "<br><b>6.सामाजिक समर्थन:</b> बच्चों को सामाजिक समर्थन प्रदान करें ताकि वे हमेशा समर्थित महसूस करें।\n<br>" +
                        "\n" +
                        "<br><b>7.अधिकारों की जागरूकता:</b> बच्चों को उनके अधिकारों की जागरूकता कराएं और उन्हें उनके हक का अभ्यास करने में मदद करें।\n" +
                        "\n" +
                        "<br><b>8.सामूहिक सहयोग:</b> उन्हें सिखाएं कि वे अगर किसी की मदद कर सकते हैं तो उन्हें मदद करें।\n<br>" +
                        "\n" +
                        "<br><b>9.स्वतंत्रता की समझ:</b> बच्चों को स्वतंत्रता का मतलब बताएं और सही-गलत की समझ दिलाएं।\n<br>" +
                        "\n" +
                        "<br><b>10.भरोसा दिलाएं:</b> उन्हें यह बताएं कि आप हमेशा उनके साथ हैं और उन्हें आप पर भरोसा है।<br>";

//        content.setText( cont );

        content2.setText(fromHtml(cont2, HtmlCompat.FROM_HTML_MODE_LEGACY));


        return view;
    }


}